# Preprocesamiento de datos con Python
## Fes Aragon 
### ICO
#### Jorge Omar Beltran Virueña

In [86]:
import pandas as pd
import numpy as np

In [87]:
from datetime import datetime
df = pd.DataFrame({'nombres':('Juan Pérez',
                                 'María Sánchez'
                                 , 'Jorge Vargas',
                                 'Rodrigo Martínez'),
            'fechas':(datetime(1995,12,21), 
                      datetime(1989,1,13), 
                      datetime(1992,9,14), 
                      datetime(1993,7,8)),
            'saldo': (2500, 
                      5345, 
                      np.NaN, 
                      11323.2),
            'al_corriente':(True, 
                            True, 
                            False, 
                            True)})
df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [88]:
#Operador iloc
#data.iloc[<filas>,columnas]
df.iloc[0] #Primer fila
print(type(df.iloc[0]))
print(df.iloc[0])

<class 'pandas.core.series.Series'>
nombres                  Juan Pérez
fechas          1995-12-21 00:00:00
saldo                        2500.0
al_corriente                   True
Name: 0, dtype: object

In [89]:
df.iloc[1] #Segunda fila

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

In [90]:
df.iloc[-1] #Última fila

nombres            Rodrigo Martínez
fechas          1993-07-08 00:00:00
saldo                       11323.2
al_corriente                   True
Name: 3, dtype: object

In [91]:
df.iloc[:,0] #Primer columna

0          Juan Pérez
1       María Sánchez
2        Jorge Vargas
3    Rodrigo Martínez
Name: nombres, dtype: object

In [92]:
df.iloc[:,1] #Segunda columna

0   1995-12-21
1   1989-01-13
2   1992-09-14
3   1993-07-08
Name: fechas, dtype: datetime64[ns]

In [93]:
df.iloc[:,-1] #Última columna

0     True
1     True
2    False
3     True
Name: al_corriente, dtype: bool

In [94]:
df.iloc[1:3] #Rango de filas

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [95]:
df.iloc[0:3:2] #Rango de filas

        nombres     fechas   saldo  al_corriente
0    Juan Pérez 1995-12-21  2500.0          True
2  Jorge Vargas 1992-09-14     NaN         False

In [96]:
df.iloc[:,1:3] #Rango de columnas

      fechas    saldo
0 1995-12-21   2500.0
1 1989-01-13   5345.0
2 1992-09-14      NaN
3 1993-07-08  11323.2

In [97]:
df.iloc[[1,3,0]] #Lista de filas

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True
0        Juan Pérez 1995-12-21   2500.0          True

In [98]:
df.iloc[:,[1,3,0]] #Lista de columnas

      fechas  al_corriente           nombres
0 1995-12-21          True        Juan Pérez
1 1989-01-13          True     María Sánchez
2 1992-09-14         False      Jorge Vargas
3 1993-07-08          True  Rodrigo Martínez

In [99]:
df.iloc[[1,3,0],[1,3,0]] #Lista de filas y columnas

      fechas  al_corriente           nombres
1 1989-01-13          True     María Sánchez
3 1993-07-08          True  Rodrigo Martínez
0 1995-12-21          True        Juan Pérez

In [100]:
df.iloc[1,[1,3,0]]

fechas          1989-01-13 00:00:00
al_corriente                   True
nombres               María Sánchez
Name: 1, dtype: object

In [101]:
df.iloc[1,:]

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

In [102]:
#iloc no trabaja con etiquetas, por lo que la línea de abajo no funciona
#df.iloc[1, 'fechas']

In [103]:
#.loc recupera filas y columnas por etiqueta(s) o matriz booleana
df.loc[1:3]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [104]:
df.loc[:,'saldo']

0     2500.0
1     5345.0
2        NaN
3    11323.2
Name: saldo, dtype: float64

In [105]:
df.loc[:,'saldo':'al_corriente'] #Rango de columnas

     saldo  al_corriente
0   2500.0          True
1   5345.0          True
2      NaN         False
3  11323.2          True

In [106]:
#No regresa nada porque el rango es inválido
df.loc[:, 'saldo':'fechas']

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [107]:
df.loc[:,'fechas':'saldo']#Rango de columnas

      fechas    saldo
0 1995-12-21   2500.0
1 1989-01-13   5345.0
2 1992-09-14      NaN
3 1993-07-08  11323.2

In [108]:
df.loc[:,['fechas','saldo','nombres']] #rango de columnas

      fechas    saldo           nombres
0 1995-12-21   2500.0        Juan Pérez
1 1989-01-13   5345.0     María Sánchez
2 1992-09-14      NaN      Jorge Vargas
3 1993-07-08  11323.2  Rodrigo Martínez

In [109]:
df.loc[1,['fechas','saldo','nombres']] #rango de columnas

fechas     1989-01-13 00:00:00
saldo                   5345.0
nombres          María Sánchez
Name: 1, dtype: object

In [110]:
df.loc[1:3,['fechas','saldo','nombres']] #rango de columnas

      fechas    saldo           nombres
1 1989-01-13   5345.0     María Sánchez
2 1992-09-14      NaN      Jorge Vargas
3 1993-07-08  11323.2  Rodrigo Martínez

In [111]:
df.loc[[1,3,2],['fechas','saldo','nombres']] #rango de columnas

      fechas    saldo           nombres
1 1989-01-13   5345.0     María Sánchez
3 1993-07-08  11323.2  Rodrigo Martínez
2 1992-09-14      NaN      Jorge Vargas

In [112]:
print(df.loc[1:3])
print('-----------------------------')
print(df.iloc[1:3])

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True
-----------------------------
         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [113]:
df_iloc= df.iloc[1:3]
df_iloc

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [114]:
print(df_iloc.loc[1])
print('-----'.center(60,'*'))
print(df_iloc.iloc[1])

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object
***************************-----****************************
nombres                Jorge Vargas
fechas          1992-09-14 00:00:00
saldo                           NaN
al_corriente                  False
Name: 2, dtype: object

In [115]:
df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [116]:
df['saldo'] > 3000

0    False
1     True
2    False
3     True
Name: saldo, dtype: bool

In [117]:
df.loc[df['saldo'] > 3000]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [118]:
df.loc[df['saldo'] > 3000, ['nombres','saldo']]

            nombres    saldo
1     María Sánchez   5345.0
3  Rodrigo Martínez  11323.2

In [119]:
ss3 =df['saldo'] > 3000
print(type(ss3))
ss3

<class 'pandas.core.series.Series'>

0    False
1     True
2    False
3     True
Name: saldo, dtype: bool

In [120]:
df.loc[ss3] #Clientes con un saldo mayor a 30000

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [121]:
df.loc[~ss3] #Clientes con un saldo no mayor a 30000

        nombres     fechas   saldo  al_corriente
0    Juan Pérez 1995-12-21  2500.0          True
2  Jorge Vargas 1992-09-14     NaN         False

In [122]:
df['al_corriente']

0     True
1     True
2    False
3     True
Name: al_corriente, dtype: bool

In [123]:
df.loc[df['al_corriente']]

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [124]:
df.loc[df['al_corriente'] , 'nombres':'saldo']

            nombres     fechas    saldo
0        Juan Pérez 1995-12-21   2500.0
1     María Sánchez 1989-01-13   5345.0
3  Rodrigo Martínez 1993-07-08  11323.2

In [125]:
df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [127]:
df.isnull()

   nombres  fechas  saldo  al_corriente
0    False   False  False         False
1    False   False  False         False
2    False   False   True         False
3    False   False  False         False

In [128]:
df_null=df.isnull()
df_null

   nombres  fechas  saldo  al_corriente
0    False   False  False         False
1    False   False  False         False
2    False   False   True         False
3    False   False  False         False

In [132]:
print(type(df.isnull().sum()))
df.isnull().sum() #Numero de datos faltantes por columna

<class 'pandas.core.series.Series'>

nombres         0
fechas          0
saldo           1
al_corriente    0
dtype: int64

In [133]:
print(type(df.isnull().sum().sum()))
df.isnull().sum().sum() #Numero de datos faltantes total

<class 'numpy.int64'>

1

In [136]:
print(type(df.isnull().values))
df.isnull().values

<class 'numpy.ndarray'>

array([[False, False, False, False],
       [False, False, False, False],
       [False, False,  True, False],
       [False, False, False, False]])

In [137]:
df.isnull().values.any()

True

In [139]:
df.isnull().any()

nombres         False
fechas          False
saldo            True
al_corriente    False
dtype: bool

In [142]:
df[df.isnull().any(1)]

C:\Users\jorge\AppData\Local\Temp\ipykernel_2516\1040708776.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  df[df.isnull().any(1)]

        nombres     fechas  saldo  al_corriente
2  Jorge Vargas 1992-09-14    NaN         False